"""
运算符
    算术运算符
        + 加
        - 减
        * 乘
        / 除
        % 取模
        ** 幂
        // 整除
    赋值运算符
        = 赋值
    复合赋值运算符
        += 加等于
        -= 减等于
        *= 乘等于
        /= 除等于
        %= 取模等于
        **= 幂等于
        //= 整除等于
"""

# 1. 演示算术运算符
a, b = 10, 3 # 同时定义多个变量
print(a + b) # 13
print(a - b) # 7
print(a * b) # 30
print(a / b) # 3.3333333333333335
"""
在Java中，Float是单精度，1个字节=8位
         Double是双精度，2个字节=16位，精确到第15位
Python中的float = Java中的Double
"""
print(a % b) # 1
print(a ** b) # 1000
print(a // b) # 3
print('-' * 28)

# 2. 演示赋值运算符
c = 100
print(c)
print('-' * 28)

# 3. 演示复合赋值运算符
a += b
print(a, b)
